<?php

$degree=36; //положение часовой стрелки в градусах
define('HOUR_DEFAULT', 0.2); // величина, показывающая количество времени в часах после прохождения одного маленького деления
define('MINUTE_DEFAULT', 12); // величина, показывающая количество времени в минутах после прохождения одного маленького деления
define('DEGREE_DEFAULT', 6); // величина, отражающая положение стрелки после прохождения одного маленького деления


// Код ниже точно не подойдет
    // function setTime() {
    //     if ($degree >= 0 && $degree <= 29) {
    //         $hour = 12;
    //     }

    //     else if ($degree >= 30 && $degree <= 59) {
    //         $hour = 13;
    //     }

    //     else if ($degree >= 60 && $degree <= 89) {
    //         $hour = 14;
    //     }

    //     else if 
    // }

?>
